app/views/videos/_show_wiki.html.erb

<h2>Video identity</h2>
<%@video = Video.find(myId)%>
---
SELECT "videos".* FROM "videos" WHERE (param_title LIKE '%x%' or param_desc LIKE '%x%')