app/views/videos/edit_wiki.html.erb


<%@video = Video.find(1)%>
---
SELECT "videos".* FROM "videos" WHERE "videos"."id" = 1 LIMIT 1