app/controllers/videos_controller.rb

  def index
    #    @videos = Video.all
    @videos = Video.search(params[:search])
---
SELECT "videos".* FROM "videos" WHERE (param_title LIKE '%%' or param_desc LIKE '%%')

  def show_wiki
    @video = Video.find(params[:id])
---
SELECT "videos".* FROM "videos" WHERE "videos"."id" = 1 LIMIT 1

  def edit
    @video = Video.find(params[:id])
---
SELECT "videos".* FROM "videos" WHERE "videos"."id" = 1 LIMIT 1

  def create
    @video = Video.new(params[:video])
    @site_url = "http://ec2-50-17-168-53.compute-1.amazonaws.com:3000"
    puts "**********DEBUG*********"
    puts request.headers["CONTENT_LENGTH"].to_s()
    puts @video.param_title
    puts "**********END*********"
    @predicted_url = "s3://webgarbagecollector/home/synaptic/NetBeansProjects/webgarbagecollector/public/movieclips/"+@video.md5+"/original/"
    #    system("for ((  i = 0 ;  i <= 100;  i++  )); do   echo $(s3cmd ls c"+@predicted_url+"\")  | cut -d \" \" -f6;sleep 2; done;");
    #    puts("for ((  i = 0 ;  i <= 100;  i++  )); do   echo $(s3cmd ls v"+@predicted_url+"\")  | cut -d \" \" -f6;sleep 2; done;");
    respond_to do |format|
      if @video.save
---
INSERT INTO "videos" ("param_wiki_country", "param_wiki_story", "updated_at", "movieclip_updated_at", "movieclip_file_size", "param_wiki_links", "movieclip_content_type", "param_mark", "param_thumb", "param_type", "param_wiki_author", "param_title", "param_size", "param_doc", "param_hits", "param_desc", "param_path", "created_at", "movieclip_file_name", "param_wiki_date") VALUES (NULL, NULL, '2011-06-14 14:46:24.224027', '2011-06-14 14:46:23.468093', 18033787, NULL, 'video/x-flv', NULL, NULL, NULL, NULL, 'Kanye_West', NULL, NULL, NULL, 'K_West_Love_Lockdown', NULL, '2011-06-14 14:46:24.224027', 'Kanye_West___Love_Lockdown.flv', NULL)

        system("s3cmd put --acl-public --recursive "+@video.movieclip.path.gsub(' ','%20')[0,@video.movieclip.path.gsub(' ','%20').index("/original")]+" s3://webgarbagecollector");
        puts("s3cmd put --acl-public --recursive "+@video.movieclip.path.gsub(' ','%20')[0,@video.movieclip.path.gsub(' ','%20').index("/original")]+" s3://webgabagecollector");
        @video.param_thumb = "http://s3.amazonaws.com/webgarbagecollector/"+@video.movieclip.path.gsub(' ','%20')[0,@video.movieclip.path.index(@video.movieclip_file_name.gsub(' ','%20'))][@video.movieclip.path.gsub(' ','%20').index(@video.md5),@video.movieclip.path.gsub(' ','%20').length]+"../"+@local_video_thumb_name ;
        @video.param_video_url = "http://s3.amazonaws.com/webgarbagecollector/"+@video.movieclip.path.gsub(' ','%20')[@video.movieclip.path.gsub(' ','%20').index(@video.md5),@video.movieclip.path.gsub(' ','%20').length];
        @video.update_attributes(params[:video]);
---
SELECT COUNT(*) FROM "videos"
UPDATE "videos" SET "updated_at" = '2011-06-14 15:01:39.639022', "movieclip_updated_at" = '2011-06-14 15:01:39.324867', "param_thumb" = 'http://ec2-50-19-167-232.compute-1.amazonaws.com:3000/movieclips/Is_thumb.jpg' WHERE "videos"."id" = 5

  def update
    @video = Video.find(params[:id])
    respond_to do |format|
      if @video.update_attributes(params[:video])
---
SELECT "videos".* FROM "videos" WHERE "videos"."id" = 0 LIMIT 1
UPDATE "videos" SET "param_wiki_story" = '', "param_wiki_country" = 'United States', "param_wiki_date" = '2011-06-14', "updated_at" = '2011-06-14 15:16:25.089614', "param_wiki_links" = '', "param_wiki_author" = 'Zangief' WHERE "videos"."id" = 1

  def edit_wiki
    @video = Video.find(params[:id])
---
SELECT "videos".* FROM "videos" WHERE "videos"."id" = 1 LIMIT 1

  def find_by_id (id)
    @video = Video.find(params[:id => id])
---
SELECT "videos".* FROM "videos" WHERE "videos"."id" = 5 LIMIT 1